In [3]:
import pandas as pd
STOCK_MAPPING_CSV = '../stock_code_name_mapping.csv'
stock_names_df = pd.read_csv(STOCK_MAPPING_CSV, usecols=['code', 'name'])

In [14]:
stock_names_df[stock_names_df['code']==6804]

     code  name
998  6804  ホシデン

In [10]:
stock_names_df.loc[(stock_names_df.index >= 1000)]

      code        name
1000  6203         豊和工
1001  1951       協エクシオ
1002  8938      J-LCHD
1003  2812         焼津水
1004  8563         大東銀
...    ...         ...
4057  1641       ダイワ機械
4058  3863         日本紙
4059  9603      H.I.S.
4060  9888       J-UEX
4061  3199  綿半ホールディングス

[3062 rows x 2 columns]